Repository: essmehdi/flow
Catalog: po/*.po
Languages: ar

source: Running
ar: جارية

source: Finished
ar: مكتملة

source: No downloads yet
ar: لا يوجد تحميل بعد

source: Add a download from URL or use your browser extension to catch one
ar: أضف تحميلا من رابط أو استعمل متصفحك

source: Add from URL
ar: تحميل من رابط

source: Preferences
ar: الإعدادات

source: About
ar: حول

source: Enter URL
ar: أدخل الرابط

source: Invalid URL
ar: رابط باطل

source: Cancel
ar: إلغاء

source: Add
ar: إضافة

source: Edit
ar: تحرير

source: Resume with new link
ar: الإستئناف برابط جديد

source: Copy download link
ar: نسخ رابط التحميل

source: Open file
ar: فتح الملف

source: Open containing folder
ar: فتح المجلد الحامل للملف

source: URL
ar: الرابط

source: File name
ar: إسم الملف

source: Directory
ar: الدليل

source: Save
ar: حفظ

source: Mehdi ESSALEHI
ar: المهدي الصالحي

source: A download manager for GNOME
ar: مدير التحميلات لGNOME

source: Copyright Ⓒ 2022 - Mehdi ESSALEHI
ar: جميع الحقوق محفوظة Ⓒ 2022 - المهدي الصالحي

source: General
ar: إعدادات عامة

source: Appearance
ar: المظهر

source: Force dark mode
ar: فرض الوضع المظلم

source: A quick toggle to force dark mode on the app
ar: مفتاح سريع لفرض الوضع المظلم

source: Downloads
ar: التحميلات

source: Timeout
ar: مهلة الإتصال

source: Time to give to a connection before dropping
ar: المهلة المسموحة للإتصال قبل الإعلان عن الفشل

source: Proxy
ar: وكيل الإتصال (Proxy)

source: Overrides system proxy settings
ar: إبطال إعدادات النظام للوكيل

source: Address
ar: العنوان

source: Port
ar: المنفذ

source: User agent
ar: عميل المستعمل (User Agent)

source: The user agent string sent in request headers
ar: عميل المستعمل المرسل في ترويسات الطلب

source: Categories
ar: الأصناف

source: Fallback settings
ar: الإعدادات الرجعية

source: Add and edit your categories for auto-sorting downloads. Note that changes only apply for new downloads.
ar: أضف وحرر أصناف التحميلات للتنظيم التلقائي للملفات

source: Category
ar: صنف

source: Edit category
ar: تحرير صنف

source: Name
ar: الإسم

source: Extensions
ar: الإمتدادات

source: Download
ar: تحميل

source: Cancel download
ar: إلغاء التحميل

source: Choose a directory
ar: إختر دليلا

source: Select
ar: إختيار

source: Permission error
ar: خطأ في الصلاحيات

source: {} is not writable
ar: لا يمكن الكتابة في الدليل {}

source: Could not make request
ar: فشل الطلب

source: Could not connect to server
ar: فشل الإتصال مع الخادم

source: Connection timed out
ar: إنتهت مهلة الإتصال

source: Could not resume download
ar: فشل استئناف التحميل

source: An error occured
ar: حدث خطأ

source: Must not be empty
ar: لا يُترك فارغًا

source: Download finished
ar: انتهى التحميل

source: Delete with files
ar: حذف الملفات أيضا

source: Are you sure ?
ar: متأكد ؟

source: This will delete the selected download(s) from history.
ar: ستُحذف التحميلات المختارة من السجل

source: The file has been moved or deleted
ar: حُذف الملف أو نُقِل

source: The file will be automatically opened once download is finished
ar: سيفتح الملف تلقائيا بعد انتهاء التحميل

source: Download request headers
ar: ترويسات طلب التحميل

source: Download link
ar: رابط التحميل

source: Logs verbose level
ar: مستوى تسجيل أحداث التطبيق
